# 利用while循环计算1-100之间数字的累加和；计算1-100之间偶数的累加和、奇数的累加和
i=1
s=0
while i<=100:
    s = s + i
    i += 1
print("1-100之间数字的累加和:%d" %s)

# 1.计算1-100之间偶数的累加和
# i=1
# s=0
# while i<=100:
#     if i % 2 == 0:
#         s = s + i
#     i += 1
# print("1-100之间偶数的累加和:%d" %s)
# 2.计算1-100之间偶数的累加和
i = 0
s = 0
while i<=100:
    s=s+i
    i+=2
print(s)

# 1.计算1-100之间奇数的累加和
# i=1
# s=0
# while i<=100:
#     if i % 2 != 0:
#         s = s + i
#     i += 1
# print("1-100之间奇数的累加和:%d" %s)
# 2.计算1-100之间奇数的累加和
i = 1
s = 0
while i<=100:
    s=s+i
    i+=2
print(s)